const ids = Array.from({ length: 7 }, (_, i) => i)
const daysOfWeek: { [key: number]: string[] } = {
  1: ['понедельник', 'понедельника', 'понедельнику', 'понедельник', 'понедельником', 'понедельнике'],
  2: ['вторник', 'вторника', 'вторнику', 'вторник', 'вторником', 'вторнике'],
  3: ['среда', 'среды', 'среде', 'среду', 'средой', 'среде'],
  4: ['четверг', 'четверга', 'четвергу', 'четверг', 'четвергом', 'четверге'],
  5: ['пятница', 'пятницы', 'пятнице', 'пятницу', 'пятницей', 'пятнице'],
  6: ['суббота', 'субботы', 'субботе', 'субботу', 'субботой', 'субботе'],
  7: ['воскресенье', 'воскресенья', 'воскресенью', 'воскресенье', 'воскресеньем', 'воскресенье']
}

const daysOfWeekPlural: { [key: number]: string[] } = {
  1: ['понедельники', 'понедельников', 'понедельникам', 'понедельники', 'понедельниками', 'понедельниках'],
  2: ['вторники', 'вторников', 'вторникам', 'вторники', 'вторниками', 'вторниках'],
  3: ['среды', 'сред', 'средам', 'среды', 'средами', 'средах'],
  4: ['четверги', 'четвергов', 'четвергам', 'четверги', 'четвергами', 'четвергах'],
  5: ['пятницы', 'пятниц', 'пятницам', 'пятницы', 'пятницами', 'пятницах'],
  6: ['субботы', 'суббот', 'субботам', 'субботы', 'субботами', 'субботах'],
  7: ['воскресенья', 'воскресений', 'воскресеньям', 'воскресенья', 'воскресеньями', 'воскресеньях']
}

export const dayShortForms: { [key: number]: string } = {
  1: 'пн',
  2: 'вт',
  3: 'ср',
  4: 'чт',
  5: 'пт',
  6: 'сб',
  7: 'вс'
}

export function getDeclension(dayIndex: number, caseIndex: number, isPlural: boolean = false) {
  const days = isPlural ? daysOfWeekPlural : daysOfWeek
  if (days.hasOwnProperty(dayIndex)) {
    return days[dayIndex][caseIndex]
  } else {
    return null
  }
}

export function convertToShortForms(days: number[]): string[] {
  return days.map((day) => dayShortForms[day] || `${day}`)
}
